---
kind: method
id: M:Autodesk.Revit.DB.Lighting.BasicLossFactor.#ctor
source: html/621a6da7-fda2-cc01-aed3-6acacf27a6d6.htm
---
# Autodesk.Revit.DB.Lighting.BasicLossFactor.#ctor Method

Creates a basic loss factor object with no loss.

## Syntax (C#)
```csharp
public BasicLossFactor()
```